{
    "table": [
        [
            "nan",
            "IST",
            "CE",
            "WE",
            "3.0",
            "52∘cm{}^{}2cm",
            "55∘cm{}^{}5cm",
            "102∘cm{}^{}2cm",
            "105∘cm{}^{}5cm"
        ],
        [
            "E1",
            "nan",
            "nan",
            "nan",
            "70.7",
            "35.2",
            "42.9",
            "58.8",
            "72.2"
        ],
        [
            "E2",
            "✓",
            "nan",
            "nan",
            "72.2",
            "42.9",
            "48.5",
            "68.7",
            "78.1"
        ],
        [
            "E3",
            "✓",
            "✓",
            "nan",
            "73.9",
            "44.2",
            "52.5",
            "68.5",
            "79.2"
        ],
        [
            "E4",
            "✓",
            "nan",
            "✓",
            "75.9",
            "43.5",
            "48.9",
            "70.4",
            "80.4"
        ],
        [
            "E5",
            "✓",
            "✓",
            "✓",
            "76.6",
            "47.5",
            "53.4",
            "72.1",
            "80.5"
        ],
        [
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan"
        ]
    ],
    "caption": "Table 3: Ablation on different configurations of network architectures. IST refers to the implicit space transformation, CE and WE denote the camera and world-space enhancement. Note: In E1 we just remove the supervision of IST, not the module itself.",
    "references": [
        "Effects of Proposed Modules.\r\nWe ablate the combination of different modules of the proposed method, the results are shown in Tab 3. Firstly we present the effectiveness of the implicit space transformation module (IST). By adding this module, we can easily observe that the baseline is greatly lifted, suggesting that transforming camera-space features to world-space counterparts and building the correspondence between them in an implicit manner indeed can benefit the pose estimation. Besides this, after adding the camera-space enhancer (CE), the precision on 55∘cm{}^{\\circ}5cm increases from 48.5 to 52.5, the reason is that with this auxiliary module, the feature extractors are enriched with more pose-sensitive information, which\r\nis beneficial to the quality of feature transformation and to improve the accuracy of final pose estimation. In addition, we show the advantage of world-space enhancer (WE), by combining it with IST. The results (E4) show that WE can further extend the performance, especially on 102∘cm{}^{\\circ}2cm and 105∘cm{}^{\\circ}5cm, which indicates that high-level supervision provides additional information different from low-level constraint. Finally, by combining all modules together, we reach relatively competitive performance."
    ]
}