{
    "table": [
        [
            "Method",
            "Prior",
            "3D_{25}",
            "3D_{50}",
            "3D_{75}",
            "52∘cm{}^{\\circ}2cm",
            "55∘cm{}^{\\circ}5cm",
            "102∘cm{}^{\\circ}2cm",
            "105∘cm{}^{\\circ}5cm",
            "1010∘cm{}^{\\circ}10cm",
            "Speed (FPS)"
        ],
        [
            "NOCS [34]",
            "✗",
            "84.9",
            "80.5",
            "30.1",
            "7.2",
            "10",
            "13.8",
            "25.2",
            "26.7",
            "4.8"
        ],
        [
            "CASS [2]",
            "✗",
            "84.2",
            "77.7",
            "-",
            "-",
            "23.5",
            "-",
            "58.0",
            "58.3",
            "-"
        ],
        [
            "FS-Net [4]",
            "✗",
            "-",
            "-",
            "-",
            "-",
            "28.2",
            "-",
            "60.8",
            "-",
            "20.8"
        ],
        [
            "DualPoseNet [22]",
            "✗",
            "-",
            "79.8",
            "62.2",
            "29.3",
            "35.9",
            "66.8",
            "-",
            "-",
            "2.3"
        ],
        [
            "GPV-Pose [7]",
            "✗",
            "84.2",
            "83.0",
            "64.4",
            "32.0",
            "42.9",
            "-",
            "73.3",
            "74.6",
            "23.6"
        ],
        [
            "SPD [30]",
            "✓",
            "83.4",
            "77.3",
            "53.2",
            "19.3",
            "21.4",
            "43.2",
            "54.1",
            "-",
            "6.3"
        ],
        [
            "CR-Net [35]",
            "✓",
            "-",
            "79.3",
            "55.9",
            "27.8",
            "34.3",
            "47.2",
            "60.8",
            "-",
            "-"
        ],
        [
            "SGPA [3]",
            "✓",
            "-",
            "80.1",
            "61.9",
            "35.9",
            "39.6",
            "61.3",
            "70.7",
            "-",
            "5.2"
        ],
        [
            "DO-Net [20]",
            "✓",
            "nan",
            "80.4",
            "63.7",
            "24.1",
            "34.8",
            "45.3",
            "67.4",
            "-",
            "11.3"
        ],
        [
            "RBP-Pose [40]",
            "✓",
            "-",
            "-",
            "67.8",
            "38.2",
            "48.1",
            "63.1",
            "79.2",
            "-",
            "26.8"
        ],
        [
            "DPDN [21]",
            "✓",
            "84.3",
            "83.4",
            "76.0",
            "46.0",
            "50.7",
            "70.4",
            "78.4",
            "80.4",
            "25.2"
        ],
        [
            "IST-Net (Ours)",
            "✗",
            "84.3",
            "82.5",
            "76.6",
            "47.5",
            "53.4",
            "72.1",
            "80.5",
            "82.6",
            "34.6"
        ],
        [
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan",
            "nan"
        ]
    ],
    "caption": "Table 1: Comparisons with state-of-art methods on REAL275 dataset. We summarize the pose estimation results reported in the original papers. Prior refers to whether the method builds upon shape priors. ‘-’ denotes no results are reported under this metric. All the experiments for inference speed are conducted with a single RTX3090Ti GPU.",
    "references": [
        "We present the results of IST-Net with state-of-the-art methods on REAL275 [34], as shown in Tab. 1. For comparison with prior-free methods, we surpass others with a large gap on all evaluation metrics, e.g., we reach 47.5 and 76.6 on 52∘cm{}^{\\circ}2cm and D75subscript𝐷75D_{75}, which outperform GPV-Pose by 19.4% and 41%. As for prior-based methods, compared with the current most powerful method DPDN [21], we still perform significant improvements in most of the metrics. e.g., 76.6 vs 76 on D75subscript𝐷75D_{75}, 47.5 vs 46.0 on 52∘cm{}^{\\circ}2cm, 53.4 vs 50.7 on 55∘cm{}^{\\circ}5cm, 80.5 vs 78.4 on 105∘cm{}^{\\circ}5cm and 82.6 vs 80.4. Notably, it is the first time for the prior-free methods to achieve comparable or even higher performance compared with prior-based methods on REAL275.\r\nIn addition, we present a per-class comparison between IST-Net and DPDN, as shown in Fig. 7. Notably, our method performs better on the prediction of rotation, the error curve is steeper on the geometrically complex object, e.g., camera, which clearly proves the effectiveness of our proposed contributions. Apart from the performance, model efficiency is also worthy of attention, we list the inference time in the last column of Tab. 1. IST-Net reaches top inference speed which far exceeds other methods by more than 25% acceleration.",
        "In this part, we provide more experimental results to support the assumption “shape priors are not necessary” which is detailed in the main paper. We choose two competitive candidates from matching-based and regression-based methods, DPDN [21] and SGPA [3], using prior deformation. We list the experimental results in Tab. 10. We can find that regardless of whether the approach is a matching-based or a direct regression-based method when we use category-independent prior and noise to replace the default shape prior, the final performance does not have a significant difference. This phenomenon further reflects that shape prior is redundant for the prior deformation process, supporting our major claims in the main paper."
    ]
}